# 악어 그리기

# 숫자는 format 메소드를 사용하여 입력할 것
import random

penalty_number = random.randint(1, 20)
# print(penalty_number)
teeth = ['01', '02', '03', '04',
            '05', '06', '07', '08',
            '09', '10', '11', '12',
            '13', '14', '15', '16',
            '17', '18', '19', '20']

tooth = 0
while tooth != penalty_number:

    print('''
            ------              -------
                0               0
      ------------------------------------
            0                       0
    ========================================
    |{0}||{1}||{2}||{3}||{4}||{5}||{6}||{7}||{8}||{9}|
    ----------------------------------------

    ----------------------------------------
    |{10}||{11}||{12}||{13}||{14}||{15}||{16}||{17}||{18}||{19}|
    ========================================
    '''.format(teeth[0], teeth[1], teeth[2], teeth[3], teeth[4],
                teeth[5], teeth[6], teeth[7], teeth[8], teeth[9],
                teeth[10], teeth[11], teeth[12], teeth[13], teeth[14],
                teeth[15], teeth[16], teeth[17], teeth[18], teeth[19]))

    tooth = int(input("악어의 이빨을 골라주세요 : "))

    if tooth not in [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]:
        print("재입력해주세요!")
    else:
        teeth[tooth - 1] = " "

print("딱! 걸렸습니다.")
